kutukvpavel/AR488-ESP32/src/AR488/AR488_Layouts.h
#endif  // AR488_MEGA32U4_MICRO
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** MICRO PRO (32u4) LAYOUT DEFINITION for MICRO (Artag) *****/
/****************************************************************/



/*****************************************/
/***** LEONARDO R3 LAYOUT DEFINITION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef AR488_MEGA32U4_LR3

#define DIO1_PIN  A0  /* GPIB 1  : PORTF bit 7 */
#define DIO2_PIN  A1  /* GPIB 2  : PORTF bit 6 */
#define DIO3_PIN  A2  /* GPIB 3  : PORTF bit 5 */
#define DIO4_PIN  A3  /* GPIB 4  : PORTF bit 4 */
#define DIO5_PIN  A4  /* GPIB 13 : PORTF bit 3 */
#define DIO6_PIN  A5  /* GPIB 14 : PORTF bit 2 */
#define DIO7_PIN   4  /* GPIB 15 : PORTD bit 4 */
#define DIO8_PIN   5  /* GPIB 16 : PORTC bit 6 */

#define IFC_PIN    8  /* GPIB 9  : PORTB bit 4 */
#define NDAC_PIN   9  /* GPIB 8  : PORTB bit 5 */
#define NRFD_PIN  10  /* GPIB 7  : PORTB bit 6 */
#define DAV_PIN   11  /* GPIB 6  : PORTD bit 6 */
#define EOI_PIN   12  /* GPIB 5  : PORTC bit 7 */

#define SRQ_PIN    2  /* GPIB 10 : PORTD bit 1 */
#define REN_PIN    3  /* GPIB 17 : PORTD bit 0 */
#define ATN_PIN    7  /* GPIB 11 : PORTE bit 6 */

uint8_t reverseBits(uint8_t dbyte);

#endif // AR488_MEGA32U4_LR3
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** LEONARDO R3 LAYOUT DEFINITION *****/
/*****************************************/



/***********************************************/
/***** MCP23S17 IC (SPI) LAYOUT DEFINITION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef AR488_MCP23S17

#include <SPI.h>

/***** NOTE: MCP23S17 pinout *****/
#define IFC_PIN    0  /* GPIB 9  : PORTA bit 0 */
#define NDAC_PIN   1  /* GPIB 8  : PORTA bit 1 */
#define NRFD_PIN   2  /* GPIB 7  : PORTA bit 2 */
#define DAV_PIN    3  /* GPIB 6  : PORTA bit 3 */
#define EOI_PIN    4  /* GPIB 5  : PORTA bit 4 */
#define REN_PIN    5  /* GPIB 17 : PORTA bit 5 */
#define SRQ_PIN    6  /* GPIB 10 : PORTA bit 6 */
#define ATN_PIN    7  /* GPIB 11 : PORTA bit 7 */

/***** NOTE: DIO1-DIO8 pins are assigned to ping 0 - 7 on port B *****/


/***** MCP23S17 defines *****/
// Direction registers
#define MCPDIRA  0x00
#define MCPDIRB  0x01

// Configuration register
#define MCPCON (0x0A)

// Pullup state register
#define MCPPUA 0x0C
#define MCPPUB 0x0D

// Port Register
#define MCPPORTA 0x12
#define MCPPORTB 0x13

// Interrupt registers
#define MCPINTENA 0x04    // Enable pin for interrupt on change (GPINTEN)
#define MCPINTCONA 0x08   // Configure interrupt: 0 = compare against previous; 1 = compare against DEFVAL
#define MCPINTFA 0x0E     // Flag that interrupt ocurred on pin (read-only)
#define MCPINTCAPA 0x10   // Read the status of the pin (read-only)
#define MCPINTPINA 2      // Pin assigned to catch MCP23S17 INTA on the Arduino controller

// MCP opcodes
#define MCPWRITE 0b01000000
#define MCPREAD  0b01000001

void mcpInit();
uint8_t mcpByteRead(uint8_t reg);
void mcpByteWrite(uint8_t reg, uint8_t db);
uint8_t mcpDigitalRead(uint8_t pin);
void mcpInterruptsEn();
void mcpIntHandler();
uint8_t getMcpIntAReg();

#endif // AR488_MCP23S17
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** MCP23S17 IC (SPI) IC LAYOUT DEFINITION *****/
/**************************************************/



/********************************************************/
/***** PANDUINO/MIGHTYCORE MCGRAW LAYOUT DEFINITION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef AR488_MEGA644P_MCGRAW

#define DIO1_PIN  10   /* GPIB 1  */
#define DIO2_PIN  11   /* GPIB 2  */
#define DIO3_PIN  12   /* GPIB 3  */
#define DIO4_PIN  13   /* GPIB 4  */
#define DIO5_PIN  14   /* GPIB 13 */
#define DIO6_PIN  15   /* GPIB 14 */
#define DIO7_PIN  16   /* GPIB 15 */
#define DIO8_PIN  17   /* GPIB 16 */

#define IFC_PIN   22   /* GPIB 9  */
#define NDAC_PIN  21   /* GPIB 8  */
#define NRFD_PIN  20   /* GPIB 7  */
#define DAV_PIN   19   /* GPIB 6  */
#define EOI_PIN   18   /* GPIB 5  */

#define SRQ_PIN   23   /* GPIB 10 */
#define REN_PIN   24   /* GPIB 17 */
#define ATN_PIN   31   /* GPIB 11 */

#endif // AR488_MEGA644P_MCGRAW
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** PANDUINO/MIGHTYCORE MCGRAW LAYOUT DEFINITION *****/
/********************************************************/



/******************************************/
/***** POLOLU A-STAR 328PB ALT LAYOUT *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef AR488_328PB_ALT

/***** NOTE: UNO/NANO pinout *****/
#define DIO1_PIN  A0  /* GPIB 1  : PORTC bit 0 */
#define DIO2_PIN  A1  /* GPIB 2  : PORTC bit 1 */
#define DIO3_PIN  A2  /* GPIB 3  : PORTC bit 2 */
#define DIO4_PIN  A3  /* GPIB 4  : PORTC bit 3 */
#define DIO5_PIN  A4  /* GPIB 13 : PORTC bit 4 */
#define DIO6_PIN  A5  /* GPIB 14 : PORTC bit 5 */
#define DIO7_PIN  A6  /* GPIB 15 : PORTD bit 4 */
#define DIO8_PIN  A7  /* GPIB 16 : PORTD bit 5 */

#define IFC_PIN    5  /* GPIB 9  : PORTD bit 5 */
#define NDAC_PIN   6  /* GPIB 8  : PORTD bit 6 */
#define NRFD_PIN   7  /* GPIB 7  : PORTD bit 7 */
#define DAV_PIN    8  /* GPIB 6  : PORTB bit 0 */
#define EOI_PIN    9  /* GPIB 5  : PORTB bit 1 */

#define SRQ_PIN    3  /* GPIB 10 : PORTD bit 3 */
#define REN_PIN    2  /* GPIB 17 : PORTD bit 2 */
#define ATN_PIN    4  /* GPIB 11 : PORTD bit 4 */

#endif
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** POLOLU A-STAR 328PB ALT LAYOUT *****/
/******************************************/



/*************************************/
/***** POE_ETHERNET_GPIB_ADAPTOR *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef POE_ETHERNET_GPIB_ADAPTOR

uint8_t reverseBits(uint8_t dbyte);
uint8_t readPortPullupReg(PORT_t port);
void setPortPullupBits(PORT_t port, uint8_t reg);

/***** KOFEN's POE Ethernet Gpib Adaptor pinout *****/
#define DIO1_PIN  22  /* GPIB 1  : PORTD bit 0 */
#define DIO2_PIN  23  /* GPIB 2  : PORTD bit 1 */
#define DIO3_PIN  24  /* GPIB 3  : PORTD bit 2 */
#define DIO4_PIN  24  /* GPIB 4  : PORTD bit 3 */
#define DIO5_PIN  26  /* GPIB 13 : PORTD bit 4 */
#define DIO6_PIN  27  /* GPIB 14 : PORTD bit 5 */
#define DIO7_PIN  28  /* GPIB 15 : PORTD bit 4 */
#define DIO8_PIN  29  /* GPIB 16 : PORTD bit 5 */

#define IFC_PIN   18  /* GPIB 9  : PORTC bit 0 */
#define NDAC_PIN  17  /* GPIB 8  : PORTC bit 1 */
#define NRFD_PIN  16  /* GPIB 8  : PORTC bit 2 */
#define DAV_PIN   15  /* GPIB 6  : PORTC bit 3 */
#define EOI_PIN   14  /* GPIB 5  : PORTC bit 4 */
#define REN_PIN   21  /* GPIB 17 : PORTC bit 5 */
#define SRQ_PIN   19  /* GPIB 10 : PORTC bit 6 */
#define ATN_PIN   20  /* GPIB 11 : PORTC bit 7 */

