kutukvpavel/AR488-ESP32/src/AR488/AR488_Layouts.h
#endif // ESP32_Wilhelm_AR488_ESP32S2_R5
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** ESP32_Wilhelm_AR488_ESP32S2_Rx LAYOUT DEFINITIONS *****/
/***********************************************/

/***********************************************/
/***** ESP32_Wilhelm_AR488_ESP32S2_Rx LAYOUT DEFINITIONS *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef ESP32_Wilhelm_AR488_ESP32S2_R4
#define DIO1_PIN   8    /* GPIB  8 */
#define DIO2_PIN   9    /* GPIB  9 */
#define DIO3_PIN   10   /* GPIB 10 */
#define DIO4_PIN   11   /* GPIB 11 */
#define DIO5_PIN   12   /* GPIB 12 */
#define DIO6_PIN   13   /* GPIB 13 */
#define DIO7_PIN   14   /* GPIB 14 */
#define DIO8_PIN   15   /* GPIB 15 */

#define IFC_PIN    38   /* GPIB 34 */
#define NDAC_PIN   33   /* GPIB 33 */
#define NRFD_PIN   34   /* GPIB 34 */
#define DAV_PIN    40   /* GPIB 40 */
#define EOI_PIN    35   /* GPIB 35 */

#define SRQ_PIN    37   /* GPIB 37 */
#define REN_PIN    26   /* GPIB 21 */
#define ATN_PIN    36   /* GPIB 36 */

#endif // ESP32_Wilhelm_AR488_ESP32S2_R4

#ifdef ESP32_Wilhelm_AR488_ESP32S2_R5

#define DIO1_PIN   8    /* GPIB  8 */
#define DIO2_PIN   9    /* GPIB  9 */
#define DIO3_PIN   10   /* GPIB 10 */
#define DIO4_PIN   11   /* GPIB 11 */
#define DIO5_PIN   12   /* GPIB 12 */
#define DIO6_PIN   13   /* GPIB 13 */
#define DIO7_PIN   14   /* GPIB 14 */
#define DIO8_PIN   15   /* GPIB 15 */

#define IFC_PIN     4   /* GPIB  4 */
#define NDAC_PIN   33   /* GPIB 33 */
#define NRFD_PIN   34   /* GPIB 34 */
#define DAV_PIN     5   /* GPIB  5 */
#define EOI_PIN    35   /* GPIB 35 */

#define SRQ_PIN    37   /* GPIB 37 */
#define REN_PIN    21   /* GPIB 21 */
#define ATN_PIN    36   /* GPIB 36 */

#endif // ESP32_Wilhelm_AR488_ESP32S2_R5
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** ESP32_Wilhelm_AR488_ESP32S2_Rx LAYOUT DEFINITIONS *****/
/***********************************************/



/***************************************/
/***** RAS PICO LAYOUT 1 DEFINITION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef RAS_PICO_L1

void gpioFuncList();

#define DIO1_PIN   6   /* GPIB 1  */
#define DIO2_PIN   7   /* GPIB 2  */
#define DIO3_PIN   8   /* GPIB 3  */
#define DIO4_PIN   9   /* GPIB 4  */
#define DIO5_PIN  10   /* GPIB 13 */
#define DIO6_PIN  11   /* GPIB 14 */
#define DIO7_PIN  12   /* GPIB 15 */
#define DIO8_PIN  13   /* GPIB 16 */

#define IFC_PIN   14   /* GPIB 9  */
#define NDAC_PIN  15   /* GPIB 8  */
#define NRFD_PIN  16   /* GPIB 7  */
#define DAV_PIN   17   /* GPIB 6  */
#define EOI_PIN   18   /* GPIB 5  */

#define REN_PIN   19   /* GPIB 17 */
#define SRQ_PIN   20   /* GPIB 10 */
#define ATN_PIN   21   /* GPIB 11 */

#endif // RAS_PICO_L1
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** RAS PICO LAYOUT 1 DEFINITION *****/
/****************************************/



/****************************************/
/***** RAS PICO LAYOUT 2 DEFINITION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef RAS_PICO_L2

void gpioFuncList();

#define DIO1_PIN  14   /* GPIB 1  */
#define DIO2_PIN  15   /* GPIB 2  */
#define DIO3_PIN  16   /* GPIB 3  */
#define DIO4_PIN  17   /* GPIB 4  */
#define DIO5_PIN  18   /* GPIB 13 */
#define DIO6_PIN  19   /* GPIB 14 */
#define DIO7_PIN  20   /* GPIB 15 */
#define DIO8_PIN  21   /* GPIB 16 */

#define IFC_PIN    6   /* GPIB 9  */
#define NDAC_PIN   7   /* GPIB 8  */
#define NRFD_PIN   8   /* GPIB 7  */
#define DAV_PIN    9   /* GPIB 6  */
#define EOI_PIN   10   /* GPIB 5  */

#define REN_PIN   11   /* GPIB 17 */
#define SRQ_PIN   12   /* GPIB 10 */
#define ATN_PIN   13   /* GPIB 11 */

#endif // RAS_PICO_L2
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** RAS PICO LAYOUT 2 DEFINITION *****/
/****************************************/



/*************************************************/
/***** NANO RP2040 CONNECT LAYOUT DEFINITION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef RPI_NANO_RP2040

#define DIO1_PIN  21   /* D9, GPIB 1  */
#define DIO2_PIN  20   /* D8, GPIB 2  */
#define DIO3_PIN  19   /* D7, GPIB 3  */
#define DIO4_PIN  18   /* D6, GPIB 4  */
#define DIO5_PIN  17   /* D5, GPIB 13 */
#define DIO6_PIN  16   /* D4, GPIB 14 */
#define DIO7_PIN  15   /* D3, GPIB 15 */
#define DIO8_PIN  25   /* D2, GPIB 16 */

#define IFC_PIN   27   /* D15, GPIB 9  */
#define NDAC_PIN  28   /* D16, GPIB 8  */
#define NRFD_PIN  29   /* D17, GPIB 7  */
#define DAV_PIN   12   /* D18, GPIB 6  */
#define EOI_PIN   13   /* D19, GPIB 5  */

#define SRQ_PIN    6   /* D13, GPIB 10 */
#define REN_PIN    4   /* D12, GPIB 17 */
#define ATN_PIN    7   /* D10, GPIB 11 */

#endif // RPI_NANO_RP2040
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** NANO RP2040 CONNECT LAYOUT DEFINITION *****/
/*************************************************/


#ifdef ESP32_Paul_WT32ETH01
  #define DATABUS_IS_SHIFT_REGISTERED
  #define DATABUS_DST_LOAD_LEVEL HIGH

  #define DIN_PIN       36
  #define DOUT_PIN      38
  #define DCLK_PIN      12
  #define DST_PIN       37

  #define IFC_PIN   5   /* GPIB 9  */
  #define NDAC_PIN  15   /* GPIB 8  */
  #define NRFD_PIN  14   /* GPIB 7  */
  #define DAV_PIN   17   /* GPIB 6  */
  #define EOI_PIN   4   /* GPIB 5  */

  #define SRQ_PIN    39   /* GPIB 10 */
  #define REN_PIN    33   /* GPIB 17 */
  #define ATN_PIN    32   /* GPIB 11 */
#endif


/**************************************/
/***** ESP32 DEFINITIONS SECTION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef ESP32_FUNCTIONS

//#include <driver/gpio.h>
#include <esp32-hal-gpio.h>
#include <esp32-hal-matrix.h>
#include <esp32/rom/gpio.h>
#include <hal/gpio_hal.h>
#include <soc/soc.h>

unsigned long setRegisterMask(const uint8_t bus[]);

#endif  // ESP32_FUNCTIONS
/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** GLOBAL DEFINITIONS SECTION *****/
/**************************************/



/**************************************/
/***** GLOBAL DEFINITIONS SECTION *****/
/***** vvvvvvvvvvvvvvvvvvvvvvvvvv *****/

void readyGpibDbus();
uint8_t readGpibDbus();
void setGpibDbus(uint8_t db);
//void setGpibState(uint8_t bits, uint8_t mask, uint8_t mode);
void setGpibCtrlState(uint8_t bits, uint8_t mask);
void setGpibCtrlDir(uint8_t bits, uint8_t mask);
uint8_t getGpibPinState(uint8_t pin);

#ifdef LEVEL_SHIFTER
  void initLevelShifter();
  void shiftEnable(bool stat);
#endif

#if defined(RAS_PICO_L1) || defined(RAS_PICO_L2)
  void initRpGpioPins();
#endif


/***** ^^^^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** GLOBAL DEFINITIONS SECTION *****/
/**************************************/


#endif // AR488_LAYOUTS_H
